In [121]:
import pandas as pd
import numpy as np

In [122]:
df=pd.read_csv("covid_toy.csv")

In [123]:
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

In [124]:
df.tail(3)

    age  gender  fever   cough       city has_covid
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

In [125]:
df.shape

(100, 6)

In [126]:
df.columns

Index(['age', 'gender', 'fever', 'cough', 'city', 'has_covid'], dtype='object')

In [127]:
df.dtypes

age            int64
gender        object
fever        float64
cough         object
city          object
has_covid     object
dtype: object

In [128]:
df.describe()  #it will return statically view of our data.

              age       fever
count  100.000000   90.000000
mean    44.220000  100.844444
std     24.878931    2.054926
min      5.000000   98.000000
25%     20.000000   99.000000
50%     45.000000  101.000000
75%     66.500000  102.750000
max     84.000000  104.000000

In [129]:
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

In [130]:
df['gender'].value_counts()

gender
Female    59
Male      41
Name: count, dtype: int64

In [131]:
df['city'].value_counts()

city
Kolkata      32
Bangalore    30
Delhi        22
Mumbai       16
Name: count, dtype: int64

In [132]:
df['cough'].value_counts()

cough
Mild      62
Strong    38
Name: count, dtype: int64

In [133]:
df['has_covid'].value_counts()

has_covid
No     55
Yes    45
Name: count, dtype: int64

In [134]:
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

In [135]:
df['gender'][0]='Female'

C:\Users\anilj\AppData\Local\Temp\ipykernel_2332\3795830263.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['gender'][0]='Female'
C:\Users\anilj\AppData\Local\Temp\ipykernel_2332\3795830263.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['gender'][0]='Female'

In [136]:
df.head(3)

   age  gender  fever cough     city has_covid
0   60  Female  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No

In [157]:
df2=df.copy()

In [158]:
df2['gender']=df2['gender'].map({'Female':0,'Male':1})

In [162]:
df2['Gender']=df2['gender'].map({'Female':0,'Male':1})

In [163]:
df2

    age  gender  fever   cough       city has_covid  Gender
0    60       0  103.0    Mild    Kolkata        No     NaN
1    27       1  100.0    Mild      Delhi       Yes     NaN
2    42       1  101.0    Mild      Delhi        No     NaN
3    31       0   98.0    Mild    Kolkata        No     NaN
4    65       0  101.0    Mild     Mumbai        No     NaN
..  ...     ...    ...     ...        ...       ...     ...
95   12       0  104.0    Mild  Bangalore        No     NaN
96   51       0  101.0  Strong    Kolkata       Yes     NaN
97   20       0  101.0    Mild  Bangalore        No     NaN
98    5       0   98.0  Strong     Mumbai        No     NaN
99   10       0   98.0  Strong    Kolkata       Yes     NaN

[100 rows x 7 columns]

In [146]:
df2.drop

   age  gender  fever cough     city has_covid
0   60  Female  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [152]:
df2['has_covid']=df2['has_covid'].map({'Yes':0,'No':1})

In [154]:
df2.head(3)

   age  gender  fever cough     city  has_covid
0   60     NaN  103.0  Mild  Kolkata        NaN
1   27     NaN  100.0  Mild    Delhi        NaN
2   42     NaN  101.0  Mild    Delhi        NaN